In [4]:
numbers= [1,2,3,4,5,6,7,8]
even_num= ["even " for x in numbers if x%2== 0 ]
print(even_num)

['even ', 'even ', 'even ', 'even ']

In [7]:
category = ["even" if x%2==0 else "odd" for x in numbers]
print(category)

['odd', 'even', 'odd', 'even', 'odd', 'even', 'odd', 'even']

In [8]:
cat= [(x, "even") if x%2==0 else (x, "odd") for x in numbers]
print(cat)

[(1, 'odd'), (2, 'even'), (3, 'odd'), (4, 'even'), (5, 'odd'), (6, 'even'), (7, 'odd'), (8, 'even')]

In [ ]:
even_nm, odd_nm = list(filter(lambda x: x%2=0

In [11]:
Keys= ['A','B','C,']
Values = [ 1,2,3]
dict_ = {key:value for key, value in zip (Keys, Values)} 
print(dict_)

{'A': 1, 'B': 2, 'C,': 3}

In [13]:
Numbers = [1,2,3,4,5,6]
set_={x**2 for x in Numbers}
print(set_)

[1, 4, 36, 9, 16, 25]

## Modular Programming

In [20]:
from mymod import *

In [19]:
add(2,4)

6

In [21]:
subt(2,4)

-2

## OBJECT programming

In [22]:
class Car:
    def __init__(self, make, model, year): #this is called instructor
        self.make = make
        self.model = model
        self.year = year

    def display_info(self):
        print(f"{self.year} {self.make} {self.model}")

In [24]:
x= Car('Hyundia', 'sonata', 2024)
x.display_info()

2024 Hyundia sonata

## Inheritance

In [40]:
class swim:
    def swimming(self):
        print('swimming')
class fly:
    def flying(self):
        print('flying')

# class Duck:
 #   def swmming(self):
   #     print('swimming')
    # def flying(self):
      #  print('flying') 
class Duck(swim, fly):
    pass

In [41]:
x = Duck()

In [46]:
x.swimming()

swimming

### Multilevel inheritance

In [52]:
class Animal:
    def speak(self):
        print('speaking')
class Dog(Animal):
    def barks(self):
        print('Dog barks')
  

class puppy:
    def barks(self):
        print('Dog barkks')
    def speak(self):
        print('Speaking')
    def play(self):
        print('play')

In [53]:
class papi(Dog):
    def play(self):
        print('play')

In [54]:
x=papi()

In [55]:
x.speak()

speaking

### Hirachical Inheritance

In [56]:
class Animal:
    def speak(self):
        print("Animal speaks")

class Dog(Animal):
    def bark(self):
        print("Dog barks")

class Cat(Animal):
    def meow(self):
        print("Cat meows")

In [59]:
class myclass:
    def __init__(self, x):
        self.__x=x

## Encapsulation

In [60]:
class Car:
    def __init__(self, make, model):
        self._make = make
        self._model = model

    def get_make(self):
        return self._make

    def set_make(self, make):
        self._make = make

    def get_model(self):
        return self._model

    def set_model(self, model):
        self._model = model

In [65]:
x= Car('Toyta','corolla')
x.set_make('Honda')
x.get_make()

'Honda'

In [121]:
class BankAccount:
    def __init__(self, account_number, initial_balance):
        self.__account_number = account_number  # Private attribute
        self.__balance = initial_balance  # Private attribute

    def deposit(self, amount):
        if amount > 0:
            self.__balance += amount

    def withdraw(self, amount):
        if 0 < amount <= self.__balance:
            self.__balance -= amount
            print(f"{'Withdraw success,  Balance: '} {account.get_balance()}") 
            
        else:
            print("Insufficient funds")

    def get_balance(self):
        return self.__balance

In [114]:
account = BankAccount("123456", 1000)

In [82]:
print("Initial Balance:", account.get_balance())

Initial Balance: 1000

In [122]:
account.withdraw(20)

('Withdraw success,  Balance: ', 560

In [128]:
f= open('Leadership.txt', "r")

In [129]:
content= f.read()
print(content)

In [125]:
f.close()

In [127]:
f= open('Leadership.txt', "a")

## Pandas

In [1]:
import pandas as pd

In [2]:
accra =pd.DataFrame({'Town':['Circle','Madina','East Legon'],
                    'Humidity':[32,29,34],
                    'Temperature':[28,30,25]})
kumasi =pd.DataFrame({'Town':['Kejetia','Amakom','Mantia'],
                    'Humidity':[27,39,36],
                    'Temperature':[30,26,24]})

In [4]:
df_3 = pd.concat([accra,kumasi], ignore_index=True, axis= 0)
df_3

         Town  Humidity  Temperature
0      Circle        32           28
1      Madina        29           30
2  East Legon        34           25
3     Kejetia        27           30
4      Amakom        39           26
5      Mantia        36           24

### Merge

In [13]:
df_5 = pd.DataFrame({'Names': ['Ama', 'Barry', 'Celestine', 'Dela'], 'Score1': [1, 2, 3, 4]})
df_6 = pd.DataFrame({'Names': ['Barry', 'Dela', 'Emma', 'Frank'], 'Score2': [5, 6, 7, 8]})

In [12]:
pd.merge(df_5, df_6, on='Names', how='inner')

   Names  Score1_x  Score1_y
0  Barry         2         5
1   Dela         4         6

In [4]:
data = { "Name": ['Austin', 'Pascal', 'Eniola','Juliet','Vincent'],
        "Age": [30,34,50,12,14]
}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

      Name  Age
0   Austin   30
1   Pascal   34
2   Eniola   50
3   Juliet   12
4  Vincent   14

In [9]:
Filtered=df[df['Age']>22]

In [10]:
Filtered

     Name  Age
0  Austin   30
1  Pascal   34
2  Eniola   50

In [18]:
df[(df['Name'] == 'Austin') & (df['Age'] > 22)]

     Name  Age
0  Austin   30